app/Validation/UtilisateurRules.php

SELECT *
FROM `adherent`
WHERE `login` = 'saliou@gmail.com'
AND `motPasse` = 'passer12'
 LIMIT 1
---
    public function utilisateurValide(string $str, string $fields, array $data){
        $model= new AdherentModel();
        $user=$model->where("login",$data["login"])->where("motPasse",$data["motPasse"])->first();