app/Controllers/Utilisateur.php

SELECT *
FROM `adherent`
WHERE `login` = 'saliou@gmail.com'
AND `motPasse` = 'passer12'
 LIMIT 1
---
    public function index()
    {
           $data=["titre"=>"Se Connecter","menuActif"=>"connexion"];
        if($this->request->getMethod()=="post"){
            $reglesValid=[
                "login"=>["rules"=>"required|valid_email","errors"=>["required"=>"login obligatoire ","valid_email"=>"email nom valide"]],
                "motPasse"=>["rules"=>"required|utilisateurValide[login, motPasse]","errors"=>["required"=>"le mot de passe est obligatoire ","utilisateurValide"=>"Email et /ou mot de passe incorrect(s)"]],
            ];
            if(!$this->validate($reglesValid)){
                $data['validation']=$this->validator;
            }
            else{//login et mot de passe correct
                $model= new AdherentModel();
                $user = $model->where('login',$this->request->getPost('login'))->where('motPasse',$this->request->getPost('motPasse'))->first();