app/Models/AdherentModel.php

SELECT *
FROM `adherent`
JOIN `participer` as `p` ON `p`.`idAdherent`=`adherent`.`id`
JOIN `tontine` as `t` ON `t`.`id`=`p`.`idTontine`
WHERE `t`.`id` = '1'
---
    function participer($idTontine){
        return $this->join("participer as p","p.idAdherent=adherent.id")->join("tontine as t","t.id=p.idTontine")->where("t.id=",$idTontine)->findAll();

SELECT COUNT(`adherent`.`id`) AS `nbCotis`, `adherent`.`id`
FROM `adherent`
JOIN `cotiser` `c` ON `c`.`idAdherent`=`adherent`.`id`
JOIN `echeance` `e` ON `e`.`id`=`c`.`idEcheance`
WHERE `e`.`idTontine` = '1'
GROUP BY `adherent`.`id`
---
    function cotiser($idTontine){
        $cotis=$this->selectCount('adherent.id','nbCotis')
                    ->select('adherent.id')
                    ->join("cotiser c","c.idAdherent=adherent.id")
                    ->join("echeance e","e.id=c.idEcheance")
                    ->where("e.idTontine",$idTontine)
                    ->groupBy("adherent.id")
                    ->get()->getResultArray();