app/Models/EcheanceModel.php

    function echeancesTontine($idTontine){
        return $this->where('idTontine',$idTontine)->findAll();
---
SELECT *
FROM `echeance`
WHERE `idTontine` = '1'

    function echeancesTab($tab){

       $cotisations=$this->select()->get()->getResultArray();;
---
SELECT *
FROM `echeance`