app/Models/TontineModel.php

    function listeTontineAdherent($idAdherent){
        return $this->where('idAdherent',$idAdherent)->findAll();
---
SELECT *
FROM `tontine`
WHERE `idAdherent` IS NULL