app/Models/TontineModel.php

SELECT DISTINCT `idTontine`
FROM `participer`
WHERE `idAdherent` = 'idAdherent'
SELECT *
FROM `tontine`
---
    function listeTontines($idAdherent){
        //1. recuperer la liste des tontine auxquelles l'adherent participe
        $listPart=$this->builder('participer')->distinct()->select('idTontine')->where('idAdherent',$idAdherent)->get()->getResultArray();

        //2. garder les idTontine dans un tableaux
        $idTon=[];
        foreach($listPart as $tp)
        $idTon[]=$tp['idTontine'];
        //3. Recuperer la liste des tontines sans les tontines deja choisi
        if($idTon)
            $this->whereNotIn("id",$idTon);
        return $this->findAll();

SELECT *
FROM `tontine`
WHERE `tontine`.`id` = '1'
---
    function tontine($idTontine){
        return $this->find($idTontine);

SELECT *
FROM `tontine`
WHERE `idResponsable` = '1'
---
    function listeTontineAdherent($idAdherent){
        return $this->where('idResponsable',$idAdherent)->findAll();