app/Models/TontineModel.php

SELECT *
FROM `tontine`
WHERE `idResponsable` IS NULL
---
    function listeTontineAdherent($idAdherent){
        return $this->where('idResponsable',$idAdherent)->findAll();